---
kind: property
id: P:Autodesk.Revit.DB.ExternalFileReference.ExternalFileReferenceType
source: html/d7c3eb93-c7a5-d395-23c2-cdff6606fc10.htm
---
# Autodesk.Revit.DB.ExternalFileReference.ExternalFileReferenceType Property

The type of external file which this object
 references.

## Syntax (C#)
```csharp
public ExternalFileReferenceType ExternalFileReferenceType { get; }
```